app/views/orders/show.html.erb

<ul>
  <% @order.order_items.each do |item| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]