app/controllers/products_controller.rb

  def index
    @products = Product.all

    if params[:query].present?
      @products = @products.where("LOWER(name) LIKE ?", "%#{params[:query].downcase}%")
    end

    if params[:category].present?
      @products = @products.where(category: params[:category])
    end

    @products = @products.page(params[:page]).per(5) # Show 5 products per page
---
SELECT "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]