app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (LOWER(name) LIKE ?)  [[nil, "%laptop%"]]
---
  def index
    @products = Product.all